In [5]:
import pandas as pd

In [53]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=['A', 'B', 'C'],index=['X','Y','Z'])

In [55]:
df

   A  B  C
X  1  2  3
Y  4  5  6
Z  7  8  9

In [57]:
df.index

Index(['X', 'Y', 'Z'], dtype='object')

In [59]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, X to Z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [63]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [65]:
df.nunique()

A    3
B    3
C    3
dtype: int64

In [67]:
df.shape

(3, 3)

In [69]:
df.size

9

## Loading in dataframes from files

In [76]:
coffee=pd.read_csv('./warm_up_data/coffee.csv')

In [80]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [84]:
coffee.tail()

         Day Coffee Type  Units Sold
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [97]:
coffee.sample(2) # sample changes everytime we run

      Day Coffee Type  Units Sold
0  Monday    Espresso          25
9  Friday       Latte          35

In [95]:
coffee.sample(2, random_state=2) # constant sample all the time

          Day Coffee Type  Units Sold
11   Saturday       Latte          35
4   Wednesday    Espresso          35

In [105]:
coffee.loc[0]

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [107]:
coffee.loc[1:3]

       Day Coffee Type  Units Sold
1   Monday       Latte          15
2  Tuesday    Espresso          30
3  Tuesday       Latte          20

In [103]:
coffee.loc[[0,1,2]]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [113]:
coffee.loc[5:8,'Coffee Type':'Units Sold']

  Coffee Type  Units Sold
5       Latte          25
6    Espresso          40
7       Latte          30
8    Espresso          45

In [115]:
coffee.loc[5:8, 'Day'::2]

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45